/* 班级 学号 姓名 */
#include <iostream>
#include <iomanip>  //用于debug信息打印时的格式
#include <fstream>
//不再允许加入任何头文件，特别是<Windows.h>/<Wingdi.h>，查到就是0分甚至是倒扣-20 ！！！
using namespace std;

#include "13-b7-bmp.h"

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：is_debug，用于查看调试信息，不需要实现（或者按自己的方式实现，对debug的输出不做要求）
            其余内容按需补充
***************************************************************************/
bitmap::bitmap(const char *const filename, const bool is_debug)
{
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：按需补充
***************************************************************************/
bitmap::~bitmap()
{
}

//按需增加内容
